const About = () => {
    return (
        <section className="about">
            <article>
                <p className="about__text">Агенція креативних екскурсій «Капітан Київ». 
                <br />
                    Проводимо прогулянки та екскурсії. Знаємо більшість дивних кафе та двориків Києва.
                </p>
                <p className="about__text"> Закохані у Київ та ділимося цим з гостями та друзями.
                    Наш формат — це «інді»-екскурсії. Прогулянки, в яких ми виходимо за межі звичних туристичних маршрутів та відкриваємо нові місця. Атмосферні локації, незвичайні місця та несподівані знахідки — головне в наших мандрівках.
                    Справжня подорож починається з одного кроку і зробити його дуже просто. Запрошуємо в мандрівку!
                </p>
            </article>

            <img className="about__img" src="https://thumb.tildacdn.com/tild3762-3763-4633-b730-333434323534/-/resize/1000x/-/format/webp/03_kk_duke-youtube_c.jpg" alt="" />
        </section>

    )
}
export default About