import InfoCard from "./InfoCard"
import Modal from "./Modal";
import { useState } from "react"
const Home = () => {
    const [showModal, setShow] = useState(false)
    
    const onBuyButtonClick = () => {
        setShow(true)
    }
    const onCloseButtonClick = () => {
        setShow(false)
    }

    return (<>
        <p className="page__text--big">Креативні екскурсії містом</p>
        <main className="page">
            <InfoCard
                toShowModal={onBuyButtonClick}
                imgUrl="https://thumb.tildacdn.com/tild3939-3261-4739-b537-366338633963/-/cover/560x314/center/center/-/format/webp/05_Vechir_v_Andriivs.jpg"
                title="СУБОТА 27/01 18:00 Вечірні таємниці Андріївської церкви. ПРЕМ'ЄРА!"
                info="Запрошуємо вас потрапити в Андріївську церкву тоді, коли вона зачинена для всіх інших та розкрити таємниці найкрасивішого храму Києва 18 ст!
                Вона сяє під зорями, овіяна таємницями минулого, легендами та містикою. Це справжній шедевр, «візітівка» Києва, — храм, який ніби плине у повітрі. Ми познайомимося з багатою архітектурою Андріївської церкви, красивим внутрішнім оформленням, розшифруємо її сховані символи та почуємо неймовірну історію."
            />
            < InfoCard
                toShowModal={onBuyButtonClick}
                imgUrl="https://thumb.tildacdn.com/tild6265-6630-4736-b762-653335383036/-/cover/560x314/center/center/-/format/webp/05_Nezvychayna_lavra.jpg"
                title="НЕДІЛЯ 28/01 12:00 Незвичайна Лавра та її підземелля"
                info="Запрошуємо у подорож Києво-Печерською Лаврою, щоб відкрити нове, невідоме, таємниче та вельми цікаве. На нас чекають інтригуючі історії про залаштунки життя ченців, як буденне, так і містичне, мальовнича архітектура, фантастичні краєвиди та, звичайно, секрети минулого, які ми дізнаємося під час нашої прогулянки.
                Наприкінці ми потрапимо до лаврського підземелля та спробуємо дізнатися, які таємниці приховували тут монахи від зайвих очей та зустрінемося…А з ким, дізнаєтесь під час екскурсії."
            />
            < InfoCard
                toShowModal={onBuyButtonClick}
                imgUrl="https://thumb.tildacdn.com/tild3061-3961-4237-b163-646463383764/-/cover/560x314/center/center/-/format/webp/05_KK_kinostudiya_do.jpg"
                title="НЕДІЛЯ 28/01 11:00
                Секрети кіностудії Довженко"
                info="Прогулянка «Українським Голівудом» — кіностудією ім. Олександра Довженка! Ми прогуляємося навколо центрального павільйону, що є найбільшим знімальним майданчиком Європи, дізнаємося про факти та історії з життя кіноіндустрії у минулому столітті, поговоримо про відомі фільми, що були тут зняті, згадаємо видатних режисерів та відвідаємо музей Олександра Довженка.
                А наприкінці екскурсії завітаємо до музею реквізиту та костюмів, де можна одягнути історичні костюми та зробити оригінальні світлини."
            />
            < InfoCard
                toShowModal={onBuyButtonClick}
                imgUrl="https://thumb.tildacdn.com/tild6366-3037-4932-a362-303262643435/-/cover/560x314/center/center/-/format/webp/04_underground_kresh.jpg"
                title="СУБОТА 27/01 16:00
                Підземний Хрещатик"
                info="Екскурсія в підземні тунелі під Хрещатиком. Пройти близько трьох кілометрів під землею від Олімпійської до головної вулиці Києва та вийти в несподіваному місці. На власні очі побачити старовинні тунелі, побудовані в середині XIX століття, та підземні річки: Клов і його притоки Кловиця та Хрещатик."
            />
        </main>
        <Modal isItShows={showModal} toCloseModal={onCloseButtonClick} />
    </>
    )
}

export default Home